jmeter-tests/results/load_test_final_report/statistics.json
{
  "Admin Reports" : {
    "transaction" : "Admin Reports",
    "sampleCount" : 27,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 20133.7037037037,
    "medianResTime" : 19467.0,
    "minResTime" : 6567.0,
    "maxResTime" : 41088.0,
    "pct1ResTime" : 36502.6,
    "pct2ResTime" : 40670.799999999996,
    "pct3ResTime" : 41088.0,
    "throughput" : 0.14464957301589004,
    "receivedKBytesPerSec" : 2.5441488829168857,
    "sentKBytesPerSec" : 0.06257789145121023
  },
  "Admin Reports-0" : {
    "transaction" : "Admin Reports-0",
    "sampleCount" : 27,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10672.22222222222,
    "medianResTime" : 8991.0,
    "minResTime" : 2847.0,
    "maxResTime" : 25069.0,
    "pct1ResTime" : 21910.399999999998,
    "pct2ResTime" : 24967.8,
    "pct3ResTime" : 25069.0,
    "throughput" : 0.1465798045602606,
    "receivedKBytesPerSec" : 0.12583447848805646,
    "sentKBytesPerSec" : 0.032636909609120524
  },
  "Mahasiswa Home-1" : {
    "transaction" : "Mahasiswa Home-1",
    "sampleCount" : 685,
    "errorCount" : 1,
    "errorPct" : 0.1459854,
    "meanResTime" : 9318.762043795618,
    "medianResTime" : 8513.0,
    "minResTime" : 2015.0,
    "maxResTime" : 26033.0,
    "pct1ResTime" : 20576.2,
    "pct2ResTime" : 22156.799999999996,
    "pct3ResTime" : 24257.62,
    "throughput" : 3.7062687342415948,
    "receivedKBytesPerSec" : 61.93733869615089,
    "sentKBytesPerSec" : 0.7962686733722176
  },
  "Mahasiswa Home-0" : {
    "transaction" : "Mahasiswa Home-0",
    "sampleCount" : 685,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10716.148905109485,
    "medianResTime" : 9900.0,
    "minResTime" : 2025.0,
    "maxResTime" : 26080.0,
    "pct1ResTime" : 21671.6,
    "pct2ResTime" : 24067.3,
    "pct3ResTime" : 24957.34,
    "throughput" : 3.6757800971264523,
    "receivedKBytesPerSec" : 3.1742329408253065,
    "sentKBytesPerSec" : 0.839973186257412
  },
  "Admin Reports-1" : {
    "transaction" : "Admin Reports-1",
    "sampleCount" : 27,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9461.185185185186,
    "medianResTime" : 7836.0,
    "minResTime" : 2458.0,
    "maxResTime" : 25628.0,
    "pct1ResTime" : 18053.6,
    "pct2ResTime" : 22920.799999999985,
    "pct3ResTime" : 25628.0,
    "throughput" : 0.1490584474734593,
    "receivedKBytesPerSec" : 2.4937314367026064,
    "sentKBytesPerSec" : 0.031296451373822025
  },
  "My Reports" : {
    "transaction" : "My Reports",
    "sampleCount" : 570,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16148.084210526325,
    "medianResTime" : 12458.0,
    "minResTime" : 4425.0,
    "maxResTime" : 41454.0,
    "pct1ResTime" : 31305.999999999993,
    "pct2ResTime" : 35523.999999999985,
    "pct3ResTime" : 40106.999999999985,
    "throughput" : 3.2054165916861614,
    "receivedKBytesPerSec" : 56.40869799633345,
    "sentKBytesPerSec" : 1.439933234546518
  },
  "Report Form Page" : {
    "transaction" : "Report Form Page",
    "sampleCount" : 491,
    "errorCount" : 491,
    "errorPct" : 100.0,
    "meanResTime" : 8478.27087576375,
    "medianResTime" : 8431.0,
    "minResTime" : 2068.0,
    "maxResTime" : 24473.0,
    "pct1ResTime" : 14169.6,
    "pct2ResTime" : 14907.8,
    "pct3ResTime" : 16669.399999999998,
    "throughput" : 4.036567520018415,
    "receivedKBytesPerSec" : 6.473766871269668,
    "sentKBytesPerSec" : 0.950012472973084
  },
  "Admin Claims" : {
    "transaction" : "Admin Claims",
    "sampleCount" : 21,
    "errorCount" : 21,
    "errorPct" : 100.0,
    "meanResTime" : 13341.57142857143,
    "medianResTime" : 11648.0,
    "minResTime" : 4472.0,
    "maxResTime" : 24880.0,
    "pct1ResTime" : 22077.600000000002,
    "pct2ResTime" : 24622.199999999997,
    "pct3ResTime" : 24880.0,
    "throughput" : 0.12697568113383237,
    "receivedKBytesPerSec" : 0.20294025227346935,
    "sentKBytesPerSec" : 0.028147929313847606
  },
  "Mahasiswa Home" : {
    "transaction" : "Mahasiswa Home",
    "sampleCount" : 685,
    "errorCount" : 1,
    "errorPct" : 0.1459854,
    "meanResTime" : 20035.175182481755,
    "medianResTime" : 20151.0,
    "minResTime" : 4437.0,
    "maxResTime" : 41709.0,
    "pct1ResTime" : 35560.6,
    "pct2ResTime" : 37695.1,
    "pct3ResTime" : 40629.78,
    "throughput" : 3.635263649486287,
    "receivedKBytesPerSec" : 63.88998149033869,
    "sentKBytesPerSec" : 1.6117282195964593
  },
  "My Claims-0" : {
    "transaction" : "My Claims-0",
    "sampleCount" : 513,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7449.970760233915,
    "medianResTime" : 6346.0,
    "minResTime" : 2027.0,
    "maxResTime" : 25197.0,
    "pct1ResTime" : 14425.0,
    "pct2ResTime" : 21033.0,
    "pct3ResTime" : 24485.64,
    "throughput" : 3.255571914504747,
    "receivedKBytesPerSec" : 2.810635324383155,
    "sentKBytesPerSec" : 0.756666128566533
  },
  "Profile Page" : {
    "transaction" : "Profile Page",
    "sampleCount" : 490,
    "errorCount" : 490,
    "errorPct" : 100.0,
    "meanResTime" : 10704.94081632653,
    "medianResTime" : 10911.0,
    "minResTime" : 2032.0,
    "maxResTime" : 20544.0,
    "pct1ResTime" : 15964.000000000002,
    "pct2ResTime" : 16502.749999999996,
    "pct3ResTime" : 17183.09,
    "throughput" : 5.600192006583082,
    "receivedKBytesPerSec" : 8.983299070253837,
    "sentKBytesPerSec" : 1.2961381890236237
  },
  "My Claims-1" : {
    "transaction" : "My Claims-1",
    "sampleCount" : 513,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7103.378167641322,
    "medianResTime" : 7354.0,
    "minResTime" : 2055.0,
    "maxResTime" : 24880.0,
    "pct1ResTime" : 9719.6,
    "pct2ResTime" : 11208.699999999999,
    "pct3ResTime" : 22387.780000000002,
    "throughput" : 3.5213442886266755,
    "receivedKBytesPerSec" : 58.92819968055642,
    "sentKBytesPerSec" : 0.7565388120096374
  },
  "Login Mahasiswa" : {
    "transaction" : "Login Mahasiswa",
    "sampleCount" : 980,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 37135.11224489797,
    "medianResTime" : 37957.5,
    "minResTime" : 5555.0,
    "maxResTime" : 55912.0,
    "pct1ResTime" : 51637.7,
    "pct2ResTime" : 52538.1,
    "pct3ResTime" : 54691.9,
    "throughput" : 4.990706083059608,
    "receivedKBytesPerSec" : 93.2521378793955,
    "sentKBytesPerSec" : 3.986716382756601
  },
  "Login Admin" : {
    "transaction" : "Login Admin",
    "sampleCount" : 30,
    "errorCount" : 30,
    "errorPct" : 100.0,
    "meanResTime" : 8944.8,
    "medianResTime" : 8115.5,
    "minResTime" : 2602.0,
    "maxResTime" : 20792.0,
    "pct1ResTime" : 17281.100000000002,
    "pct2ResTime" : 19056.749999999996,
    "pct3ResTime" : 20792.0,
    "throughput" : 0.18621280399240253,
    "receivedKBytesPerSec" : 3.1617261112249078,
    "sentKBytesPerSec" : 0.06437434825518602
  },
  "My Claims" : {
    "transaction" : "My Claims",
    "sampleCount" : 513,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14553.499025341142,
    "medianResTime" : 13296.0,
    "minResTime" : 4481.0,
    "maxResTime" : 42705.0,
    "pct1ResTime" : 20499.600000000002,
    "pct2ResTime" : 30466.6,
    "pct3ResTime" : 39615.34000000001,
    "throughput" : 3.206971568602936,
    "receivedKBytesPerSec" : 56.43598300828624,
    "sentKBytesPerSec" : 1.4343681429884223
  },
  "Login Mahasiswa-0" : {
    "transaction" : "Login Mahasiswa-0",
    "sampleCount" : 980,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13579.759183673472,
    "medianResTime" : 13894.5,
    "minResTime" : 1927.0,
    "maxResTime" : 25884.0,
    "pct1ResTime" : 22605.0,
    "pct2ResTime" : 24221.6,
    "pct3ResTime" : 25163.95,
    "throughput" : 5.088873541492494,
    "receivedKBytesPerSec" : 5.529215870469994,
    "sentKBytesPerSec" : 1.80893551670241
  },
  "My Reports-0" : {
    "transaction" : "My Reports-0",
    "sampleCount" : 570,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9042.200000000008,
    "medianResTime" : 8054.5,
    "minResTime" : 2132.0,
    "maxResTime" : 25248.0,
    "pct1ResTime" : 21021.4,
    "pct2ResTime" : 23812.3,
    "pct3ResTime" : 24658.45,
    "throughput" : 3.242948010422949,
    "receivedKBytesPerSec" : 2.8009596654785343,
    "sentKBytesPerSec" : 0.7600659399428786
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10387,
    "errorCount" : 1084,
    "errorPct" : 10.436122,
    "meanResTime" : 13978.466352170977,
    "medianResTime" : 10859.0,
    "minResTime" : 701.0,
    "maxResTime" : 55912.0,
    "pct1ResTime" : 30248.600000000006,
    "pct2ResTime" : 38391.600000000006,
    "pct3ResTime" : 51603.240000000005,
    "throughput" : 52.89612254667305,
    "receivedKBytesPerSec" : 519.2547762771432,
    "sentKBytesPerSec" : 17.4290292107595
  },
  "Login Mahasiswa-1" : {
    "transaction" : "Login Mahasiswa-1",
    "sampleCount" : 980,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13177.8081632653,
    "medianResTime" : 13465.0,
    "minResTime" : 1041.0,
    "maxResTime" : 26109.0,
    "pct1ResTime" : 21863.399999999998,
    "pct2ResTime" : 23758.5,
    "pct3ResTime" : 25474.749999999993,
    "throughput" : 5.0901158261050234,
    "receivedKBytesPerSec" : 4.396042783916792,
    "sentKBytesPerSec" : 1.1631709993247805
  },
  "My Reports-1" : {
    "transaction" : "My Reports-1",
    "sampleCount" : 570,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7105.647368421055,
    "medianResTime" : 5256.5,
    "minResTime" : 2051.0,
    "maxResTime" : 25358.0,
    "pct1ResTime" : 15372.099999999999,
    "pct2ResTime" : 20644.399999999994,
    "pct3ResTime" : 24261.87,
    "throughput" : 3.3476440221061967,
    "receivedKBytesPerSec" : 56.020219980956604,
    "sentKBytesPerSec" : 0.7192203953743782
  },
  "Login Mahasiswa-2" : {
    "transaction" : "Login Mahasiswa-2",
    "sampleCount" : 980,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10377.323469387746,
    "medianResTime" : 9698.0,
    "minResTime" : 701.0,
    "maxResTime" : 26050.0,
    "pct1ResTime" : 21206.8,
    "pct2ResTime" : 22412.799999999985,
    "pct3ResTime" : 25170.66,
    "throughput" : 5.0812481204566895,
    "receivedKBytesPerSec" : 85.03461539520963,
    "sentKBytesPerSec" : 1.0916744008793668
  },
  "Admin Home" : {
    "transaction" : "Admin Home",
    "sampleCount" : 30,
    "errorCount" : 30,
    "errorPct" : 100.0,
    "meanResTime" : 9819.866666666669,
    "medianResTime" : 7970.5,
    "minResTime" : 2273.0,
    "maxResTime" : 25057.0,
    "pct1ResTime" : 20625.100000000002,
    "pct2ResTime" : 22737.1,
    "pct3ResTime" : 25057.0,
    "throughput" : 0.1634360801490537,
    "receivedKBytesPerSec" : 0.26152964934789,
    "sentKBytesPerSec" : 0.03591124807962606
  },
  "Admin Users" : {
    "transaction" : "Admin Users",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 14132.349999999999,
    "medianResTime" : 12791.5,
    "minResTime" : 5090.0,
    "maxResTime" : 23739.0,
    "pct1ResTime" : 22534.700000000004,
    "pct2ResTime" : 23686.1,
    "pct3ResTime" : 23739.0,
    "throughput" : 0.18071091674648065,
    "receivedKBytesPerSec" : 0.28881098711079384,
    "sentKBytesPerSec" : 0.039883464047563114
  }
}